a = {
    '医疗':[
        '医保卡购买',
         '医疗器械公司注册',
         '医疗器械经营许可',
         '医疗保险转移',
         '本地（异地）医疗报销',
         '互联网药品信息服务许可证',
         '医疗器械广告批准文号',
         '医疗器械网络经营备案',
         '新型农村合作医疗异地就医报销',
         '一次性工伤医疗'
    ],

    '版权专利':
        [
         '外观专利申请',
         '专利权转让',
         '发明专利申请',
         '外观专利申请',
         '撤回专利申请',
         '著作权登记',
         '著作权保护',
         '著作权转让',
         '国际专利申请',
         '商标注册',
         '商标转让',
         '商标续展',
         '商标变更',
         '国际商标注册',
        '香港公司注册'
        ],

    '教育':
        [
         '幼儿园报名',
         '小学报名',
         '初中报名',
         '高中报名',
         '成人高考报名',
         '高考志愿填报',
         '大学报名入学',
         '幼儿园转学',
         '小学转学',
         '初中转学',
         '高中转学',
         '国家贫困学生补助申请',
         '大学专业等级考试及证书考取',
         '出国留学',
         '研究生及以上学位',
         '在校参加兵役',
         '才艺等级考试报名',
         '一级建造师',
         '二级建造师',
         '造价工程师',
         '注册咨询工程师(投资)',
         ' 质量专业技术资格',
         '监理工程师 ',
         '经济师',
         '一级注册建筑师',
         '二级注册建筑师',
         '投资建设项目管理师',
         '环境影响评价工程师',
         '房地产经纪人',
         '房地产估价师',
         '会计职称',
         '企业法律顾问',
         '人力资源管理师',
         '营销师',
         '电子商务师',
         '物流师',
         '物业管理师',
         '经营师',
         '策划师',
         '营养师',
         '秘书',
         '项目管理师',
         '心理咨询师',
         '公关员',
         '企业培训师',
         '职业经理人',
         '理财规划师',
         '园艺师',
         '景观设计师',
         '造价员',
         '建筑预算员',
         '建筑质检员',
         '建筑材料员',
         '建筑施工员',
         '建筑安全员',
         '建筑五大员年审继教',
         '装饰预算员',
         '装饰施工员',
         '物业管理企业经理',
         '会计从业资格证',
         '会计职称',
         '教师资格',
         '导游资格',
         '中级导游',
         'ISO9000内审员/外审员',
         'ISO14000',
         '保险经纪人',
         '保险代理人',
         '报关员',
         '监理工程师',
         '咨询工程师',
         '安全评价师',
         '设备监理师',
         '师',
         '质量资格',
         '投资项目管理师',
         '安全工程师',
         '房地产经纪人',
         '土地登记代理人',
         '环境影响评价师',
         '经济师',
         '注册税务师',
         '资产评估师',
         '会计职称',
         '报关员',
         '报检员',
         '外销员',
         '单证员',
         '注册会计师',
         '会计证',
         '统计师',
         '审计师',
         '企业法律顾问',
         '国际商务师',
         '执业药师',
         '临床执业',
         '助理医师',
         '口腔执业药师',
         '中医师',
         '卫生职称',
         '国际商务单证员',
         '国际商务跟单员',
         '国际货运代理师',
         '营销师',
         '物流管理师',
         '信用管理师',
         '会展管理师',
         '房地产职业经理人',
         '理财规划师',
         '汽车营销师',
         '职业经理人',
         '人力资源管理师',
         '项目管理师'
        ],

    '房屋租售':
        [
            '出租与租房',
            '商品房购买',
            '二手房购买与出租',
            '分期付购房',
            '房屋户主继承',
            '转移',
            '房屋公证'
        ],

    '商务':
        [
         '公司注册',
         '法律服务',
         '签证',
         '用车',
         '出差申请审批报销',
         '差旅分析报告',
         '信息咨询',
         '广告服务',
         '公关服务',
         '教育培训',
         '直接保险',
         '再保险和转分保',
         '贷款',
         '财务租赁',
         '信用卡支付',
         '代客交易',
         '转让票据',
         '资产管理',
         '养老保险',
         '健康保险',
         '寿险',
         '教育储蓄险',
         '意外伤害保险',
         '万能险',
         '财产险',
         '工商营业执照',
         '食品流通许可证',
         '税务登记证营业执照',
         '生产许可证',
         '组织机构代码证',
         '税务登记证',
         '商标注册证',
         '条码证',
         '第三方检验报告',
         '餐饮服务许可证',
         '烟草许可证',
         '健康证',
         '税务登记证',
         '网络文化经营许可证',
         '出版物经营许可证',
         '兽药经营许可证',
         '个体工商营业执照',
         '卫生许可证',
         '开户许可证',
         '注册法人',
         '医疗器械许可证',
         '预包装食品经营许可证',
         '茶叶经营许可证',
         '酒类批发经营许可证',
         '散装食品许可证',
         '乳制品经营许可证',
         '奶粉经营许可证',
         '保健品经营许可证',
         '快餐服务许可证',
         '小吃服务许可证',
         '粥粉面服务许可证',
         '火锅等中餐制售许可证',
         '小型餐饮服务许可证',
         '中型餐饮服务许可证',
         '大型餐饮服务许可证',
         '工商备案',
         '农药经营许可证',
         '药监许可证',
         '品牌授权书',
         '道路运输许可证',
         'QS/CS生产许可证',
         '金融许可证',
         '药品监督局备案',
         'ICP经营许可证',
         '危化品经营许可证',
         'EDI经营许可证',
         '快递经营许可证',
         '劳动派遣经营许可证',
         '特种行业经营许可证',
         '出版物经营许可证',
         '广播节目制作许可证'
        ],

    '车辆买卖':
        [
         '车辆销售',
         '车辆转让',
         '车辆外包协议书',
         '车辆运输协议书',
         '汽车租凭合同',
         '车辆保养',
         '车辆使用管理协议书',
         '车辆加盟协议',
         '车辆上户',
         '二手车过户'
        ],

    '农业':
        [
         '租用土地',
         '承包土地',
         '国家占地',
         '养殖许可',
         '园林申请'
         ],

    '交通安全':
        [
            '驾照考试', '车辆审批', '驾照审查', '车辆事故报修', '违规扣分', '罚款罚单', '行驶许可证'
        ],

    '机关':
        [
         '民事诉讼',
         '行政诉讼',
         '刑事诉讼（公诉）',
         '刑事诉讼（自诉）',
         '建档立卡',
         '低保',
         '五保',
         '户口迁移',
         '上户',
         '征兵入伍',
         '因伤退役',
         '结婚领证',
         '大学生落户',
         '加入共产党',
         '国家贷款',
         '公证文件',
         '房产过户',
         '林木采伐证'
        ],

    '入职工作':
        [
            '劳动合同', '退休补贴', '党员入职', '公民纳税', '五险一金', '企业公积金', '入股企业'
        ],

    '餐饮':
        [
            '餐饮服务', '餐饮店', '餐饮营业执照', '食品经营许可证', '餐饮管理', '厨房管理', '餐饮操作', '餐厅装修', '餐厅经营'
        ],

    '社会保障':
        [
            '社保卡办理', '社保办理', '社保缴纳', '相关证件办理', '社保转移', '代缴社保', '个人社保'
        ]
}

keys = a.keys()

import pymysql.cursors

# 连接数据库
connect = pymysql.Connect(
    host = "127.0.0.1",
    port = 3306,
    user = "root",
    passwd = "520lkl",
    db = "zhichengariticle",
    charset = "utf8"
)
# # 获取游标
cursor = connect.cursor()

sql1 = "INSERT INTO labels(labelname) VALUES (%s)"
for key in keys:
    try:
        cursor.execute(sql1, key)
    except:
        pass

import pdb
sql2 = "INSERT INTO labels(labelname,father_name) VALUES (%s,%s)"
for key in keys:
    # pdb.set_trace()
    for label in a[key]:
        data = (label,key)
        try:
            cursor.execute(sql2, data)
        except:
            pass

connect.commit()#不提交到不了数据库中
connect.close()


# print(cursor.fetchone()[0])
# print(cursor.execute(sql))
